accstarkam.ОбменМагистральБП/src/InformationRegisters/МС_НаименованиеНоменклатуры/МС_НаименованиеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_НаименованиеНоменклатуры</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

accstarkam.ОбменМагистральБП/src/InformationRegisters/МС_ОчередьВыгрузки/МС_ОчередьВыгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_ОчередьВыгрузки</name>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

accstarkam.ОбменМагистральБП/src/CommonModules/МС_ОбщийМодуль1ВызовСервера/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура МС_ПриЗаписиНоменклатурыПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаОбъект = Источник.Ссылка;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК НовоеНаименование,
		|	Номенклатура.НаименованиеПолное КАК НовоеНаименованиеПолное,
		|	ЕСТЬNULL(АктуальноеНаименование.Наименование, &ПустаяСтрока) КАК Наименование,
		|	ЕСТЬNULL(АктуальноеНаименование.НаименованиеПолное, &ПустаяСтрока) КАК НаименованиеПолное
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МС_НаименованиеНоменклатуры КАК АктуальноеНаименование
		|		ПО Номенклатура.Ссылка = АктуальноеНаименование.Ссылка
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";

	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Наименование <> Выборка.НовоеНаименование 
		Или Выборка.НаименованиеПолное <> Выборка.НовоеНаименованиеПолное Тогда
			
			АктуализироватьРегистрНаименованиеНоменклатуры(Выборка);
			
			ОтправитьНоменклатуруВОчередьНаВыгрузку(Выборка.Ссылка);
			
			ФоновыеЗадания.Выполнить(
				"МС_ОбщийМодуль1ВызовСервера.ВыполнитьВыгрузкуНоменклатурыВРозницу",
				Новый Массив //ТОDО: Нужны параметны или нет
			);
	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьВыгрузкуНоменклатуры() Экспорт

КонецПроцедуры

Функция ВыгрузитьВсюНоменклатуру() Экспорт
	Возврат ВыгрузитьВсюНоменклатуруВJSON();
КонецФункции

Функция ВыгрузитьНоменклатуруПоМассивуСсылок(Знач МассивСсылок) Экспорт
	Возврат ВыгрузитьНоменклатуруВJSONПоМассивуСсылок(МассивСсылок);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьНоменклатуруВОчередьНаВыгрузку(Ссылка)
	МенеджерЗаписи = РегистрыСведений.МС_ОчередьВыгрузки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ссылка = Ссылка;
	МенеджерЗаписи.Записать();
КонецПроцедуры

Процедура АктуализироватьРегистрНаименованиеНоменклатуры(Выборка)
	МенеджерЗаписи = РегистрыСведений.МС_НаименованиеНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ссылка = Выборка.Ссылка;
	МенеджерЗаписи.Наименование = Выборка.НовоеНаименование;
	МенеджерЗаписи.НаименованиеПолное = Выборка.НовоеНаименованиеПолное;
	МенеджерЗаписи.Записать();
КонецПроцедуры

#Область ВыгрузкаНоменклатуры

Функция ВыгрузитьВсюНоменклатуруВJSON()

	ТаблицаНоменклатуры = ПолучитьТаблицуВсейНоменклатуры();

	Возврат СформироватьJSONПоТаблицеНоменклатуры(ТаблицаНоменклатуры);

КонецФункции


Функция ВыгрузитьНоменклатуруВJSONПоМассивуСсылок(МассивСсылок)

	МассивСсылокДляЗапроса = НормализоватьМассивСсылокНоменклатуры(МассивСсылок);

	Если МассивСсылокДляЗапроса.Количество() = 0 Тогда
		Возврат "[]";
	КонецЕсли;

	ТаблицаНоменклатуры = ПолучитьВсехРодителейИПотомковСИерархией(МассивСсылокДляЗапроса);

	Возврат СформироватьJSONПоТаблицеНоменклатуры(ТаблицаНоменклатуры);

КонецФункции


Функция СформироватьJSONПоТаблицеНоменклатуры(ТаблицаНоменклатуры)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписьJSON.ЗаписатьНачалоМассива();

	КорневыеЭлементы = ПостроитьИерархию(ТаблицаНоменклатуры);

	Для Каждого Элемент Из КорневыеЭлементы Цикл
		ВыгрузитьЭлементВJSON(ЗаписьJSON, Элемент);
	КонецЦикла;

	ЗаписьJSON.ЗаписатьКонецМассива();
	
	
	Возврат ЗаписьJSON.Закрыть();

КонецФункции


Функция ПолучитьТаблицуВсейНоменклатуры()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	Номенклатура.Родитель КАК Родитель,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Родитель,
		|	Номенклатура.ЭтоГруппа УБЫВ,
		|	Номенклатура.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции


Функция ПолучитьТаблицуНоменклатурыПоСсылкам(МассивСсылок)

	Если МассивСсылок.Количество() = 0 Тогда
		Возврат СоздатьПустуюТаблицуНоменклатуры();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	Номенклатура.Родитель КАК Родитель,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В (&МассивСсылок)
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Родитель,
		|	Номенклатура.ЭтоГруппа УБЫВ,
		|	Номенклатура.Наименование";

	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции


Функция ПолучитьВсехРодителейИПотомковСИерархией(МассивСсылок)

	МассивСсылокРезультат = Новый Массив;
	ИндексСсылок = Новый Соответствие;

	Для Каждого Ссылка Из МассивСсылок Цикл
		ДобавитьСсылкуЕслиНовая(МассивСсылокРезультат, ИндексСсылок, Ссылка);
	КонецЦикла;

	МассивСсылокРезультат = ПолучитьВсехРодителей(
		МассивСсылок,
		МассивСсылокРезультат,
		ИндексСсылок
	);

	МассивСсылокРезультат = ПолучитьВсехПотомков(
		МассивСсылок,
		МассивСсылокРезультат,
		ИндексСсылок
	);

	Возврат ПолучитьТаблицуНоменклатурыПоСсылкам(МассивСсылокРезультат);

КонецФункции


Функция ПолучитьВсехРодителей(МассивСсылокДляПоиска, ТекущийМассив, ИндексСсылок)

	НаборДляПоиска = МассивСсылокДляПоиска;
	ЕстьНовыеСсылки = Истина;

	Пока ЕстьНовыеСсылки Цикл

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Номенклатура.Родитель КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка В (&МассивСсылок)
			|	И Номенклатура.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";

		Запрос.УстановитьПараметр("МассивСсылок", НаборДляПоиска);

		РезультатЗапроса = Запрос.Выполнить().Выгрузить();

		НовыеСсылки = Новый Массив;

		Для Каждого Строка Из РезультатЗапроса Цикл

			Если ДобавитьСсылкуЕслиНовая(ТекущийМассив, ИндексСсылок, Строка.Ссылка) Тогда
				НовыеСсылки.Добавить(Строка.Ссылка);
			КонецЕсли;

		КонецЦикла;

		НаборДляПоиска = НовыеСсылки;
		ЕстьНовыеСсылки = НовыеСсылки.Количество() > 0;

	КонецЦикла;

	Возврат ТекущийМассив;

КонецФункции


Функция ПолучитьВсехПотомков(МассивСсылокДляПоиска, ТекущийМассив, ИндексСсылок)

	НаборРодителей = МассивСсылокДляПоиска;
	ЕстьНовыеСсылки = Истина;

	Пока ЕстьНовыеСсылки Цикл

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Родитель В (&МассивСсылок)";

		Запрос.УстановитьПараметр("МассивСсылок", НаборРодителей);

		РезультатЗапроса = Запрос.Выполнить().Выгрузить();

		НовыеСсылки = Новый Массив;

		Для Каждого Строка Из РезультатЗапроса Цикл

			Если ДобавитьСсылкуЕслиНовая(ТекущийМассив, ИндексСсылок, Строка.Ссылка) Тогда
				НовыеСсылки.Добавить(Строка.Ссылка);
			КонецЕсли;

		КонецЦикла;

		НаборРодителей = НовыеСсылки;
		ЕстьНовыеСсылки = НовыеСсылки.Количество() > 0;

	КонецЦикла;

	Возврат ТекущийМассив;

КонецФункции


Функция ПостроитьИерархию(ТаблицаЭлементов)

	ЭлементыПоСсылкам = Новый Соответствие;
	РодителиПоСсылкам = Новый Соответствие;
	КорневыеЭлементы = Новый Массив;

	Для Каждого СтрокаНоменклатуры Из ТаблицаЭлементов Цикл

		Элемент = Новый Структура;
		Элемент.Вставить("Ссылка", СтрокаНоменклатуры.Ссылка);
		Элемент.Вставить("Родитель", СтрокаНоменклатуры.Родитель);
		Элемент.Вставить("Наименование", СтрокаНоменклатуры.Наименование);
		Элемент.Вставить("НаименованиеПолное", СтрокаНоменклатуры.НаименованиеПолное);
		Элемент.Вставить("ЭтоГруппа", СтрокаНоменклатуры.ЭтоГруппа);
		Элемент.Вставить("Дети", Новый Массив);

		ЭлементыПоСсылкам.Вставить(СтрокаНоменклатуры.Ссылка, Элемент);
		РодителиПоСсылкам.Вставить(СтрокаНоменклатуры.Ссылка, СтрокаНоменклатуры.Родитель);

	КонецЦикла;

	Для Каждого СтрокаНоменклатуры Из ТаблицаЭлементов Цикл

		Элемент = ЭлементыПоСсылкам.Получить(СтрокаНоменклатуры.Ссылка);
		Родитель = РодителиПоСсылкам.Получить(СтрокаНоменклатуры.Ссылка);

		Если Родитель.Пустая() Тогда

			КорневыеЭлементы.Добавить(Элемент);

		Иначе

			РодительЭлемент = ЭлементыПоСсылкам.Получить(Родитель);

			Если РодительЭлемент = Неопределено Тогда
				КорневыеЭлементы.Добавить(Элемент);
			Иначе
				РодительЭлемент.Дети.Добавить(Элемент);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Возврат КорневыеЭлементы;

КонецФункции


Процедура ВыгрузитьЭлементВJSON(ЗаписьJSON, Элемент)

	ЗаписьJSON.ЗаписатьНачалоОбъекта();

	ЗаписьJSON.ЗаписатьИмяСвойства("Гуид");
	ЗаписьJSON.ЗаписатьЗначение(Строка(Элемент.Ссылка.УникальныйИдентификатор()));

	ЗаписьJSON.ЗаписатьИмяСвойства("РодительГуид");

	Если Элемент.Родитель.Пустая() Тогда
		ЗаписьJSON.ЗаписатьЗначение("");
	Иначе
		ЗаписьJSON.ЗаписатьЗначение(Строка(Элемент.Родитель.УникальныйИдентификатор()));
	КонецЕсли;

	ЗаписьJSON.ЗаписатьИмяСвойства("Наименование");
	ЗаписьJSON.ЗаписатьЗначение(ПолучитьСтрокуДляJSON(Элемент.Наименование));

	ЗаписьJSON.ЗаписатьИмяСвойства("НаименованиеПолное");
	ЗаписьJSON.ЗаписатьЗначение(ПолучитьСтрокуДляJSON(Элемент.НаименованиеПолное));

	ЗаписьJSON.ЗаписатьИмяСвойства("ЭтоГруппа");
	ЗаписьJSON.ЗаписатьЗначение(Элемент.ЭтоГруппа);

	Если Элемент.Дети.Количество() > 0 Тогда

		ЗаписьJSON.ЗаписатьИмяСвойства("Дети");
		ЗаписьJSON.ЗаписатьНачалоМассива();

		Для Каждого ДочернийЭлемент Из Элемент.Дети Цикл
			ВыгрузитьЭлементВJSON(ЗаписьJSON, ДочернийЭлемент);
		КонецЦикла;

		ЗаписьJSON.ЗаписатьКонецМассива();

	КонецЕсли;

	ЗаписьJSON.ЗаписатьКонецОбъекта();

КонецПроцедуры


Функция ПолучитьСтрокуДляJSON(Значение)

	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат Строка(Значение);

КонецФункции


Функция НормализоватьМассивСсылокНоменклатуры(МассивСсылок)

	Результат = Новый Массив;
	ИндексСсылок = Новый Соответствие;

	Если МассивСсылок = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Для Каждого ЗначениеСсылки Из МассивСсылок Цикл

		СсылкаНоменклатуры = ПреобразоватьЗначениеВСсылкуНоменклатуры(ЗначениеСсылки);

		Если СсылкаНоменклатуры <> Неопределено И Не СсылкаНоменклатуры.Пустая() Тогда
			ДобавитьСсылкуЕслиНовая(Результат, ИндексСсылок, СсылкаНоменклатуры);
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции


Функция ПреобразоватьЗначениеВСсылкуНоменклатуры(ЗначениеСсылки)

	Если ТипЗнч(ЗначениеСсылки) = Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат ЗначениеСсылки;
	ИначеЕсли ТипЗнч(ЗначениеСсылки) = Тип("Строка") Тогда
		Возврат ПолучитьСсылкуНоменклатурыИзСтроки(ЗначениеСсылки);
	ИначеЕсли ТипЗнч(ЗначениеСсылки) = Тип("УникальныйИдентификатор") Тогда
		Возврат ПолучитьСсылкуНоменклатурыИзGUID(ЗначениеСсылки);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции


Функция ПолучитьСсылкуНоменклатурыИзСтроки(СтрокаGUID)

	СтрокаGUID = СокрЛП(СтрокаGUID);

	Если СтрокаGUID = "" Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		Возврат Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаGUID));
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции


Функция ПолучитьСсылкуНоменклатурыИзGUID(GUID)

	Попытка
		Возврат Справочники.Номенклатура.ПолучитьСсылку(GUID);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции


Функция ДобавитьСсылкуЕслиНовая(МассивСсылок, ИндексСсылок, Ссылка)

	Если Ссылка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ИндексСсылок.Получить(Ссылка) = Неопределено Тогда

		ИндексСсылок.Вставить(Ссылка, Истина);
		МассивСсылок.Добавить(Ссылка);

		Возврат Истина;

	КонецЕсли;

	Возврат Ложь;

КонецФункции


Функция СоздатьПустуюТаблицуНоменклатуры()

	Таблица = Новый ТаблицаЗначений;

	Таблица.Колонки.Добавить("Ссылка");
	Таблица.Колонки.Добавить("Наименование");
	Таблица.Колонки.Добавить("НаименованиеПолное");
	Таблица.Колонки.Добавить("Родитель");
	Таблица.Колонки.Добавить("ЭтоГруппа");

	Возврат Таблица;

КонецФункции

#КонецОбласти


#КонецОбласти
